Revit 2027 API
UIApplication.FormulaEditing Event
 Subscribe to the FormulaEditing event to be notified when the edit formula button has been clicked.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<FormulaEditingEventArgs> FormulaEditing
Public Event FormulaEditing As EventHandler(Of FormulaEditingEventArgs)
public:
 event EventHandler<FormulaEditingEventArgs^>^ FormulaEditing {
	void add (EventHandler<FormulaEditingEventArgs^>^ value);
	void remove (EventHandler<FormulaEditingEventArgs^>^ value);
}
member FormulaEditing : IEvent<EventHandler<FormulaEditingEventArgs>,
    FormulaEditingEventArgs>
Value
EventHandler<FormulaEditingEventArgs>
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace